# ActLayer

## Description
Function ActLayer returns a handle to the currently active layer in a document.

```pascal
FUNCTION ActLayer : HANDLE;
```

```python
def vs.ActLayer():
    return HANDLE
```

## Remarks
For changing the active layer you can use [[VS:Layer]].

## See Also
VS Functions:
ActiveClass
| ActSymDef
| GetLName

## Version
Availability: from All Versions

## Category
* Layers